### SETUP

In [1]:
import numpy as np
import pandas as pd

# Week 1 Activity

## Instructions

***If you have any issues, please visit the help section of the course.***

***To reset all of the outputs, use the menu to go to Cell -> All Output -> Clear***

**For this assignment, make sure to start from the top and work down**

1) First, import the studentinfo.csv dataset into R as a data frame named `D1`. To do so, click on the cell below and press Shift + Enter.

You will not see any output, but you will see a number to the left in the brackets (see screenshot below). Note that if you re-run the cell, the number will change; as long as there's a number in the brackets, though, the cell has been run successfully.

![Code Cell Bracket](http://www.learninganalytics.net/wp-content/uploads/2018/04/Code-Cell-Bracket.png)

2) Next, view the data by running the following cell. (As before, click the cell and press Shift + Enter).

In [ ]:
# D1 <- read.csv("studentInfo.csv", header=TRUE)

In [2]:
D1 = pd.read_csv("/Users/quartz/data/learning_analytics/learning_analytics_fundamentals/studentInfo.csv")
D1.tail()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
32588,GGG,2014J,2640965,F,Wales,Lower Than A Level,10-20,0-35,0,30,N,Fail
32589,GGG,2014J,2645731,F,East Anglian Region,Lower Than A Level,40-50%,35-55,0,30,N,Distinction
32590,GGG,2014J,2648187,F,South Region,A Level or Equivalent,20-30%,0-35,0,30,Y,Pass
32591,GGG,2014J,2679821,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn
32592,GGG,2014J,2684003,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction

3) What does the `code_presentation` variable (column) represent?

It represents the code name of the presentation. It consists of the year and “B” for the presentation starting in February and “J” for the presentation starting in October. 

4) There are a lot of rows in this dataset, and Jupyter does not display them all. When you scroll through the output above, what do you think indicates that some rows aren't being shown? (Hint: look for a different-looking row about halfway through the output)

5) How many people from Wales enrolled in the presentation starting in October in 2014? When you run the next cell, you will see a red background with some output starting with "Attaching package: 'dplyr'" (see screenshot below). You can ignore this. The answer to the question will be at the bottom of the output.

![Red Text](http://www.learninganalytics.net/wp-content/uploads/2018/04/Red-Text.png)

In [3]:
D1b = D1[(D1.code_presentation == "2013J") & (D1.region == "Wales")]
D1b.tail()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
26104,FFF,2013J,2411773,M,Wales,A Level or Equivalent,50-60%,0-35,0,60,N,Pass
26108,FFF,2013J,2417433,M,Wales,A Level or Equivalent,0-10%,35-55,2,90,N,Withdrawn
26110,FFF,2013J,2435795,M,Wales,HE Qualification,60-70%,35-55,0,60,N,Pass
26170,FFF,2013J,2637239,M,Wales,Lower Than A Level,10-20,35-55,0,60,N,Withdrawn
26172,FFF,2013J,2641236,F,Wales,Lower Than A Level,0-10%,0-35,0,60,N,Withdrawn

In [18]:
len(D1b)

576

6) How many people enrolled from Scotland and had between 60 and 100 credits?

In [7]:
# COL <- filter(D1, region == "Scotland", studied_credits >= 60, studied_credits <= 100)
# nrow(COL)

COL = D1[(D1.region == "Scotland") & (D1.studied_credits >= 60) & (D1.studied_credits <= 100)]
print(len(COL))

COL.tail()

2379

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
30021,FFF,2014J,2584244,M,Scotland,HE Qualification,20-30%,35-55,0,90,N,Pass
30026,FFF,2014J,2602253,M,Scotland,A Level or Equivalent,0-10%,0-35,0,60,N,Withdrawn
30027,FFF,2014J,2602542,M,Scotland,Post Graduate Qualification,90-100%,35-55,2,60,N,Distinction
31956,GGG,2014J,586861,F,Scotland,Lower Than A Level,20-30%,0-35,0,90,N,Withdrawn
31996,GGG,2014J,625411,M,Scotland,Lower Than A Level,70-80%,0-35,0,90,N,Pass

7) Go back to edX and enter the answers to (5) and (6). You are now done for this part of the assignment in Week 1.

---

### EDA

In [11]:
# dependent variable

D1.final_result.value_counts()

Pass           12361
Withdrawn      10156
Fail            7052
Distinction     3024
Name: final_result, dtype: int64

In [8]:
# data types

D1.dtypes

code_module             object
code_presentation       object
id_student               int64
gender                  object
region                  object
highest_education       object
imd_band                object
age_band                object
num_of_prev_attempts     int64
studied_credits          int64
disability              object
final_result            object
dtype: object

In [9]:
D1.isna().sum().sort_values(ascending=False)

imd_band                1111
final_result               0
disability                 0
studied_credits            0
num_of_prev_attempts       0
age_band                   0
highest_education          0
region                     0
gender                     0
id_student                 0
code_presentation          0
code_module                0
dtype: int64

In [10]:
D1.describe()

         id_student  num_of_prev_attempts  studied_credits
count  3.259300e+04          32593.000000     32593.000000
mean   7.066877e+05              0.163225        79.758691
std    5.491673e+05              0.479758        41.071900
min    3.733000e+03              0.000000        30.000000
25%    5.085730e+05              0.000000        60.000000
50%    5.903100e+05              0.000000        60.000000
75%    6.444530e+05              0.000000       120.000000
max    2.716795e+06              6.000000       655.000000